In [2]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.impute import KNNImputer , SimpleImputer
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [14]:
df=pd.read_csv('data/titanic.csv',usecols=['Age','Fare','Survived','Pclass'])

In [15]:
df.head()

   Survived  Pclass   Age     Fare
0         0       3  22.0   7.2500
1         1       1  38.0  71.2833
2         1       3  26.0   7.9250
3         1       1  35.0  53.1000
4         0       3  35.0   8.0500

In [22]:
df.isnull().mean()*100

Survived     0.00000
Pclass       0.00000
Age         19.86532
Fare         0.00000
dtype: float64

In [16]:
x = df.drop(columns=['Survived'])
y= df['Survived']

In [17]:
X_train,X_test,Y_train,Y_test=train_test_split(x,y,test_size=0.2,random_state=2)

In [18]:
X_train

     Pclass   Age      Fare
30        1  40.0   27.7208
10        3   4.0   16.7000
873       3  47.0    9.0000
182       3   9.0   31.3875
876       3  20.0    9.8458
..      ...   ...       ...
534       3  30.0    8.6625
584       3   NaN    8.7125
493       1  71.0   49.5042
527       1   NaN  221.7792
168       1   NaN   25.9250

[712 rows x 3 columns]

# Apply KNN Imputer

In [19]:
knn=KNNImputer(n_neighbors=10,weights='distance')
X_train_trf=knn.fit_transform(X_train)
X_test_trf=knn.transform(X_test)

# Convert in Data Frame

In [20]:
pd.DataFrame(X_train_trf,columns=X_train.columns)

     Pclass        Age      Fare
0       1.0  40.000000   27.7208
1       3.0   4.000000   16.7000
2       3.0  47.000000    9.0000
3       3.0   9.000000   31.3875
4       3.0  20.000000    9.8458
..      ...        ...       ...
707     3.0  30.000000    8.6625
708     3.0  25.118926    8.7125
709     1.0  71.000000   49.5042
710     1.0  31.125155  221.7792
711     1.0  49.200824   25.9250

[712 rows x 3 columns]

In [21]:
pd.DataFrame(X_train_trf,columns=X_train.columns).sample(10)

     Pclass        Age     Fare
233     3.0  25.000000   7.7750
164     2.0   3.000000  18.7500
237     2.0  36.000000  10.5000
27      3.0  34.000000   6.4958
283     3.0   1.000000  15.7417
141     1.0  35.000000  53.1000
559     3.0  29.200000   7.8958
156     3.0  32.000000  15.8500
153     3.0  14.847368  21.6792
159     3.0  20.000000   7.9250

# Apply Logistic Regression

In [24]:
lr = LogisticRegression()
lr.fit(X_train_trf, Y_train)
y_pred = lr.predict(X_test_trf)
accuracy = accuracy_score(Y_test, y_pred)
print("Accuracy:", accuracy)

Accuracy: 0.7039106145251397

NameError: name 'df_train' is not defined